//------------------------------------------
///////-------TASK FROM PRACTICE
//------------------------------------------

// перебрать массив объектов
// мутировать его чтобы остались уникальные id объекты
// если объекты дублировались, у них были одинаковые id, то сложить их количество

// const products = [
//     {
//         id: "sku1",
//         qty: 1,
//     },
//     {
//         id: "sku2",
//         qty: 2,
//     },
//     {
//         id: "sku3",
//         qty: 3,
//     },
//     {
//         id: "sku1",
//         qty: 6,
//     },
//     {
//         id: "sku1",
//         qty: 8,
//     },
//     {
//         id: "sku2",
//         qty: 19,
//     },
//     {
//         id: "sku4",
//         qty: 1,
//     },
// ];

// // если айди совпадают, то поскладывать qty
// // вывести уникальные айди с новым квонтити

// function findUniqueIds(arr) {

//     for (let i = 0; i < arr.length; i += 1) {
//         console.log("first one: ", arr[i].id);
//         for (let j = i + 1; j < arr.length; j += 1) {
//             console.log("second one: ", arr[j].id);
//             if (arr[i].id === arr[j].id) {
//                 arr[i].qty += arr[j].qty;
//                 arr.splice(j, 1);
//                 j -= 1;
//             }
//         }
//     }
//     return arr;
// }

// console.log(findUniqueIds(products));



//---------------------------------------------------------------
//------------------------------------------
///////-------TASK FROM PRACTICE
//------------------------------------------



// const getArray = (array) => array.reduce((acc, num, index) => index === 0 ? [num] : [...acc, acc[index - 1] + num], [])


// console.log(getArray([1, 2, 3, 4, 5])); //[1, 3, 6, 10, 15]


//---------------------------------------------------------------


